app/Helpers/log_helper.php

    function log_activity($activity, $user_id = null)
    {
        $activityLogModel = new \App\Models\ActivityLogModel();
        $ipAddress = $_SERVER['REMOTE_ADDR'] ?? '0.0.0.0';

        if ($ipAddress === '::1') {
            $ipAddress = '127.0.0.1';
        }

        $data = [
            'user_id'  => $user_id,
            'activity' => $activity,
            'ip_address' => $ipAddress,
        ];

        $activityLogModel->insert($data);
---
INSERT INTO `tbl_activity_log` (`user_id`, `activity`, `ip_address`) VALUES ('1', 'Admin archived a Payroll with ID: 2025-902443 on Date: Fri Jan 31, 2025 12:59 PM', '127.0.0.1')