app/Controllers/ActivityLogController.php

    public function index()
    {

        try{
            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }
            $activityLogModel = new ActivityLogModel();
            $data['logs'] = $activityLogModel->orderBy('created_at', 'DESC')->findAll();

            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);
---
SELECT *
FROM `tbl_activity_log`
ORDER BY `created_at` DESC
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'