app/Controllers/ArchiveController.php

    public function index()
    {

        try {

            $session = session();
            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $departmentModel = new DepartmentModel();
            $positionModel = new PositionModel();
            $emplolyeeModel = new EmployeeModel();
            $payheadModel = new PayheadModel();
            $manualPayheadModel = new ManualPayheadModel();
            $holidayModel = new HolidayModel();
            $leaveModel = new LeaveModel();
            $userModel = new UserModel();
            $payrollModel = new PayrollModel();

            // Fetch departments where is_archive is 1
            $data['archivedDepartments'] = $departmentModel->where('is_archive', 1)->findAll();
            $data['archivedPositions'] = $positionModel
                ->select('tbl_position.*, tbl_department.department_name')
                ->join('tbl_department', 'tbl_department.department_id = tbl_position.department_id')
                ->where('tbl_position.is_archive', 1)->findAll();

            $data['archivedEmployees'] = $emplolyeeModel
                ->select('tbl_employee.*, tbl_department.department_name, tbl_position.position_name')
                ->join('tbl_department', 'tbl_department.department_id = tbl_employee.department_id')
                ->join('tbl_position', 'tbl_position.position_id = tbl_employee.position_id')
                ->where('tbl_employee.is_archive', 1)
                ->findAll();

            $data['archivePayheads'] = $payheadModel->where('is_archive', 1)->findAll();
            $data['archiveHolidays'] = $holidayModel->where('is_archive',1)->findAll();
            $data['archiveManualPayheads'] = $manualPayheadModel->where('is_archive',1)->findAll();

            $data['archivedLeaves'] = $leaveModel
            ->select('tbl_leave.*, tbl_employee.employee_id, tbl_employee.firstname, tbl_employee.middlename, tbl_employee.lastname')
            ->join('tbl_employee', 'tbl_employee.employee_id = tbl_leave.employee_id')
            ->where('tbl_leave.is_archive', 1)->findAll();


            $data['archivePayrolls'] = $payrollModel->select('reference_number, MIN(pay_period_start) as date_from, MAX(pay_period_end) as date_to, payroll_id')
                ->where('is_archive', 1)
                ->groupBy('reference_number')
                ->findAll();
---
SELECT *
FROM `tbl_department`
WHERE `is_archive` = 1
SELECT `tbl_position`.*, `tbl_department`.`department_name`
FROM `tbl_position`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_position`.`department_id`
WHERE `tbl_position`.`is_archive` = 1
SELECT `tbl_employee`.*, `tbl_department`.`department_name`, `tbl_position`.`position_name`
FROM `tbl_employee`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_employee`.`department_id`
JOIN `tbl_position` ON `tbl_position`.`position_id` = `tbl_employee`.`position_id`
WHERE `tbl_employee`.`is_archive` = 1
SELECT *
FROM `tbl_payhead`
WHERE `is_archive` = 1
SELECT *
FROM `tbl_holidays`
WHERE `is_archive` = 1
SELECT *
FROM `manual_payhead`
WHERE `is_archive` = 1
SELECT `tbl_leave`.*, `tbl_employee`.`employee_id`, `tbl_employee`.`firstname`, `tbl_employee`.`middlename`, `tbl_employee`.`lastname`
FROM `tbl_leave`
JOIN `tbl_employee` ON `tbl_employee`.`employee_id` = `tbl_leave`.`employee_id`
WHERE `tbl_leave`.`is_archive` = 1
SELECT `reference_number`, MIN(pay_period_start) as date_from, MAX(pay_period_end) as date_to, `payroll_id`
FROM `tbl_payroll`
WHERE `is_archive` = 1
GROUP BY `reference_number`



            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'