app/Controllers/ContributionTypeController.php

SELECT `tbl_employee`.`employee_id`, `tbl_employee`.`firstname`, `tbl_employee`.`lastname`, `tbl_employee`.`middlename`, `tbl_employee`.`monthly_rate`, `tbl_contribution_type`.*, `tbl_pagibig`.`salary_range_start`, `tbl_pagibig`.`salary_range_end`, `tbl_pagibig`.`employer_share`, `tbl_pagibig`.`employee_share`, `tbl_pagibig`.`employer_max_contribution`
FROM `tbl_employee`
JOIN `tbl_contribution_type` ON `tbl_contribution_type`.`employee_id` = `tbl_employee`.`employee_id`
JOIN `tbl_pagibig` ON `tbl_employee`.`monthly_rate` >= `tbl_pagibig`.`salary_range_start` AND `tbl_employee`.`monthly_rate` <= `tbl_pagibig`.`salary_range_end`
WHERE `tbl_contribution_type`.`contribution_name` = 'Pag Ibig'
SELECT *
FROM `tbl_contribution_type`
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
---
    public function pagibigList()
    {

        try {

            $session = session();
            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $userModel = new UserModel();
            $model = new ContributionTypeListModel;
            $employeeModel = new EmployeeModel();



            $data['employees'] = $employeeModel
                ->select('tbl_employee.employee_id,tbl_employee.firstname,tbl_employee.lastname, tbl_employee.middlename,tbl_employee.monthly_rate, tbl_contribution_type.*, tbl_pagibig.salary_range_start, tbl_pagibig.salary_range_end,tbl_pagibig.employer_share, tbl_pagibig.employee_share, tbl_pagibig.employer_max_contribution')

                ->join('tbl_contribution_type', 'tbl_contribution_type.employee_id = tbl_employee.employee_id')
                ->join('tbl_pagibig', 'tbl_employee.monthly_rate >= tbl_pagibig.salary_range_start AND tbl_employee.monthly_rate <= tbl_pagibig.salary_range_end')
                ->where('tbl_contribution_type.contribution_name', 'Pag Ibig')
                ->findAll();





            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);

SELECT `tbl_employee`.`employee_id`, `tbl_employee`.`firstname`, `tbl_employee`.`lastname`, `tbl_employee`.`middlename`, `tbl_employee`.`monthly_rate`, `tbl_contribution_type`.*, `tbl_philhealth`.`salary_range_start`, `tbl_philhealth`.`salary_range_end`
FROM `tbl_employee`
JOIN `tbl_contribution_type` ON `tbl_contribution_type`.`employee_id` = `tbl_employee`.`employee_id`
JOIN `tbl_philhealth` ON `tbl_employee`.`monthly_rate` >= `tbl_philhealth`.`salary_range_start` AND `tbl_employee`.`monthly_rate` <= `tbl_philhealth`.`salary_range_end`
WHERE `tbl_contribution_type`.`contribution_name` = 'Philhealth'
SELECT *
FROM `tbl_contribution_type`
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
---
    public function philhealthList()
    {

        try {

            $session = session();
            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $userModel = new UserModel();
            $model = new ContributionTypeListModel;
            $employeeModel = new EmployeeModel();

            $data['employees'] = $employeeModel
                ->select('tbl_employee.employee_id,tbl_employee.firstname,tbl_employee.lastname, tbl_employee.middlename,tbl_employee.monthly_rate, tbl_contribution_type.*, tbl_philhealth.salary_range_start, tbl_philhealth.salary_range_end')

                ->join('tbl_contribution_type', 'tbl_contribution_type.employee_id = tbl_employee.employee_id')
                ->join('tbl_philhealth', 'tbl_employee.monthly_rate >= tbl_philhealth.salary_range_start AND tbl_employee.monthly_rate <= tbl_philhealth.salary_range_end')
                ->where('tbl_contribution_type.contribution_name', 'Philhealth')
                ->findAll();





            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);