app/Controllers/HolidayController.php

SELECT *
FROM `tbl_holidays`
WHERE `is_archive` = 0
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
---
    public function index()
    {

        try {

            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $model = new HolidayModel;
            $data['holidays'] = $model->where('is_archive',0)->findAll();

            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);