app/Controllers/LeaveController.php

    public function index()
    {
        try {

            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $employeeModel = new EmployeeModel();
            $departmentModel = new DepartmentModel();

            $data['departments'] = $departmentModel->findAll();



            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);

            $leaveModel = new LeaveModel();

            $data['leaves'] = $leaveModel
                ->select('tbl_leave.*, tbl_employee.firstname,tbl_employee.middlename,tbl_employee.lastname')
                ->join('tbl_employee', 'tbl_employee.employee_id = tbl_leave.employee_id')
                ->where('tbl_leave.is_archive', 0)
                ->findAll();
---
SELECT *
FROM `tbl_department`
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT `tbl_leave`.*, `tbl_employee`.`firstname`, `tbl_employee`.`middlename`, `tbl_employee`.`lastname`
FROM `tbl_leave`
JOIN `tbl_employee` ON `tbl_employee`.`employee_id` = `tbl_leave`.`employee_id`
WHERE `tbl_leave`.`is_archive` = 0