app/Controllers/ManualPayheadController.php

SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT *
FROM `manual_payhead`
WHERE `is_archive` = 0
---
    public function index()
    {
        try {

            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }


            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);

            $model = new ManualPayheadModel();
            $data['payheads'] = $model->where('is_archive', 0)->findAll();