app/Controllers/PayheadController.php

    public function index()
    {
        try {

            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }


            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);

            $model = new PayheadModel();
            $data['payheads'] = $model->where('is_archive', 0)->findAll();
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT *
FROM `tbl_payhead`
WHERE `is_archive` = 0

    public function assignPayhead()
    {
        try {

            $session = session();

            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }


            $userModel = new UserModel();
            $payheadModel = new PayheadModel();
            $manualPayheadModel = new ManualPayheadModel();
            $employeeModel = new EmployeeModel();


            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);

            $data['employees'] = $employeeModel
                ->select('tbl_employee.*, tbl_department.department_name, tbl_position.position_name')
                ->join('tbl_department', 'tbl_department.department_id = tbl_employee.department_id')
                ->join('tbl_position', 'tbl_position.position_id = tbl_employee.position_id')
                ->where('tbl_employee.is_archive', 0)
                ->findAll();

            $data['payheads'] = $payheadModel->where('is_archive', 0)->findAll();
            $data['manual_payheads'] = $manualPayheadModel->where('is_archive', 0)->findAll();
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT `tbl_employee`.*, `tbl_department`.`department_name`, `tbl_position`.`position_name`
FROM `tbl_employee`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_employee`.`department_id`
JOIN `tbl_position` ON `tbl_position`.`position_id` = `tbl_employee`.`position_id`
WHERE `tbl_employee`.`is_archive` = 0
SELECT *
FROM `tbl_payhead`
WHERE `is_archive` = 0
SELECT *
FROM `manual_payhead`
WHERE `is_archive` = 0

    public function setPayhead($id)
    {
        try {
            $userModel = new UserModel();
            $employeeModel = new EmployeeModel();
            $payheadModel = new PayheadModel();
            $manualPayheadModel = new ManualPayheadModel();
            $employeeManualPayheadModel = new EmployeeManualPayheadModel();
            $contributionModel = new ContributionTypeListModel();
            $session = session();


            if (!$session->get('logged_in')) {
                // If not logged in, redirect to the login page
                return redirect()->to('/login');
            }

            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);
            $data['payheads'] = $payheadModel->where('is_archive', 0)->findAll();
            $data['manual_payheads'] = $manualPayheadModel->where('is_archive', 0)->findAll();
            $data['employees'] = $employeeModel
                ->select('tbl_employee.*, tbl_department.department_name, tbl_position.position_name')
                ->join('tbl_department', 'tbl_department.department_id = tbl_employee.department_id')
                ->join('tbl_position', 'tbl_position.position_id = tbl_employee.position_id')
                ->where('tbl_employee.is_archive', 0)
                ->findAll();


            // Fetch specific employee based on employee_id
            $data['employees_column'] = $employeeModel
                ->select('tbl_employee.*, tbl_department.department_name, tbl_position.position_name')
                ->join('tbl_department', 'tbl_department.department_id = tbl_employee.department_id')
                ->join('tbl_position', 'tbl_position.position_id = tbl_employee.position_id')
                ->where('tbl_employee.employee_id', $id) // Match employee_id column
                ->first();
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT *
FROM `tbl_payhead`
WHERE `is_archive` = 0
SELECT *
FROM `manual_payhead`
WHERE `is_archive` = 0
SELECT `tbl_employee`.*, `tbl_department`.`department_name`, `tbl_position`.`position_name`
FROM `tbl_employee`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_employee`.`department_id`
JOIN `tbl_position` ON `tbl_position`.`position_id` = `tbl_employee`.`position_id`
WHERE `tbl_employee`.`is_archive` = 0
SELECT `tbl_employee`.*, `tbl_department`.`department_name`, `tbl_position`.`position_name`
FROM `tbl_employee`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_employee`.`department_id`
JOIN `tbl_position` ON `tbl_position`.`position_id` = `tbl_employee`.`position_id`
WHERE `tbl_employee`.`employee_id` = '2024-976503'
 LIMIT 1

                return redirect()->to('/assign_payhead')->with('error', 'Employee not found.');
            }

            $data['assigned_payheads'] = $employeeManualPayheadModel
                ->select('tbl_employee_manual_payhead.*, manual_payhead.payhead_name, manual_payhead.head_type')
                ->join('manual_payhead', 'manual_payhead.manual_payhead_id = tbl_employee_manual_payhead.manual_payhead_id')
                ->where('tbl_employee_manual_payhead.employee_id', $id)
                ->findAll();
---
SELECT `tbl_employee_manual_payhead`.*, `manual_payhead`.`payhead_name`, `manual_payhead`.`head_type`
FROM `tbl_employee_manual_payhead`
JOIN `manual_payhead` ON `manual_payhead`.`manual_payhead_id` = `tbl_employee_manual_payhead`.`manual_payhead_id`
WHERE `tbl_employee_manual_payhead`.`employee_id` = '2024-976503'