app/Controllers/PayrollController.php

    public function index()
    {
        try {
            $session = session();
            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);
            $payrollModel = new PayrollModel();
            $data['payrolls'] = $payrollModel->select('reference_number, MIN(pay_period_start) as date_from, MAX(pay_period_end) as date_to, payroll_id')
                ->where('is_archive', 0)
                ->groupBy('reference_number')
                ->findAll();
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT `reference_number`, MIN(pay_period_start) as date_from, MAX(pay_period_end) as date_to, `payroll_id`
FROM `tbl_payroll`
WHERE `is_archive` = 0
GROUP BY `reference_number`

    public function view($referenceNumber)
    {

        try {
            $session = session();
            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);


            $payrollModel = new PayrollModel();
            $payroll = $payrollModel
                ->select('tbl_payroll.*, tbl_employee.firstname, tbl_employee.middlename, tbl_employee.lastname')
                ->join('tbl_employee', 'tbl_employee.employee_id = tbl_payroll.employee_id')
                ->where('reference_number', $referenceNumber)->findAll();

            if (!$payroll) {
                return redirect()->back()->with('error', 'Payroll not found.');
            }

            // Get payroll range
            $dateFrom = $payrollModel
                ->select('MIN(pay_period_start) as date_from')
                ->where('reference_number', $referenceNumber)
                ->first()['date_from'];

            $dateTo = $payrollModel
                ->select('MAX(pay_period_end) as date_to')
                ->where('reference_number', $referenceNumber)
                ->first()['date_to'];
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT `tbl_payroll`.*, `tbl_employee`.`firstname`, `tbl_employee`.`middlename`, `tbl_employee`.`lastname`
FROM `tbl_payroll`
JOIN `tbl_employee` ON `tbl_employee`.`employee_id` = `tbl_payroll`.`employee_id`
WHERE `reference_number` = '2025-973899'
SELECT MIN(pay_period_start) as date_from
FROM `tbl_payroll`
WHERE `reference_number` = '2025-973899'
 LIMIT 1
SELECT MAX(pay_period_end) as date_to
FROM `tbl_payroll`
WHERE `reference_number` = '2025-973899'
 LIMIT 1

    public function paysumarry($employeeId, $referenceNumber)
    {
        try {


            $session = session();
            $userModel = new UserModel();
            $userId = $session->get('id');
            $data['user'] = $userModel->find($userId);
            $payrollModel = new PayrollModel();
            $contributionModel = new ContributionTypeListModel();
            $manualPayheadsModel = new EmployeeManualPayheadModel();

            $payroll = $payrollModel
                ->select('tbl_payroll.*, tbl_employee.firstname, tbl_employee.middlename, tbl_employee.lastname, tbl_employee.monthly_rate,tbl_employee.daily_rate, tbl_department.department_name, tbl_position.position_name, tbl_employee.employee_id,tbl_employee.department_id,tbl_employee.position_id,tbl_employee.sick_leave_balance, tbl_employee.vacation_leave_balance ,tbl_department.department_id,tbl_position.position_id,tbl_contribution_type.*')
                ->join('tbl_employee', 'tbl_employee.employee_id = tbl_payroll.employee_id')
                ->join('tbl_department', 'tbl_department.department_id = tbl_employee.department_id')
                ->join('tbl_position', 'tbl_position.position_id = tbl_employee.position_id')
                ->join('tbl_contribution_type', 'tbl_contribution_type.employee_id = tbl_employee.employee_id')
                ->where('tbl_payroll.employee_id', $employeeId)
                ->where('tbl_payroll.reference_number', $referenceNumber) // Ensure employee_id is treated as a string
                // Ensure employee_id is treated as a string
                ->first(); // Use `first()` to get a single record

            if (!$payroll) {
                return redirect()->back()->with('error', 'Payroll not found.');
            }

            $contributions = $contributionModel
                ->select('contribution_name, contribution_amount')
                ->where('employee_id', $employeeId)
                ->findAll();
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'
SELECT `tbl_payroll`.*, `tbl_employee`.`firstname`, `tbl_employee`.`middlename`, `tbl_employee`.`lastname`, `tbl_employee`.`monthly_rate`, `tbl_employee`.`daily_rate`, `tbl_department`.`department_name`, `tbl_position`.`position_name`, `tbl_employee`.`employee_id`, `tbl_employee`.`department_id`, `tbl_employee`.`position_id`, `tbl_employee`.`sick_leave_balance`, `tbl_employee`.`vacation_leave_balance`, `tbl_department`.`department_id`, `tbl_position`.`position_id`, `tbl_contribution_type`.*
FROM `tbl_payroll`
JOIN `tbl_employee` ON `tbl_employee`.`employee_id` = `tbl_payroll`.`employee_id`
JOIN `tbl_department` ON `tbl_department`.`department_id` = `tbl_employee`.`department_id`
JOIN `tbl_position` ON `tbl_position`.`position_id` = `tbl_employee`.`position_id`
JOIN `tbl_contribution_type` ON `tbl_contribution_type`.`employee_id` = `tbl_employee`.`employee_id`
WHERE `tbl_payroll`.`employee_id` = '2024-222792'
AND `tbl_payroll`.`reference_number` = '2025-973899'
 LIMIT 1
SELECT `contribution_name`, `contribution_amount`
FROM `tbl_contribution_type`
WHERE `employee_id` = '2024-222792'




            $manualPayheads = $manualPayheadsModel
                ->select('manual_payhead.payhead_name, tbl_employee_manual_payhead.amount, manual_payhead.head_type')
                ->join('manual_payhead', 'manual_payhead.manual_payhead_id = tbl_employee_manual_payhead.manual_payhead_id')
                ->where('tbl_employee_manual_payhead.employee_id', $employeeId)
                ->findAll();
---
SELECT `manual_payhead`.`payhead_name`, `tbl_employee_manual_payhead`.`amount`, `manual_payhead`.`head_type`
FROM `tbl_employee_manual_payhead`
JOIN `manual_payhead` ON `manual_payhead`.`manual_payhead_id` = `tbl_employee_manual_payhead`.`manual_payhead_id`
WHERE `tbl_employee_manual_payhead`.`employee_id` = '2024-222792'

    public function archive($reference_number)
    {
        try {
            $payrollModel = new PayrollModel();

            log_message('info', 'Reference Number Received: ' . $reference_number);

            // Check if the payroll reference exists
            $payroll_reference = $payrollModel->where('reference_number', $reference_number)->first();

            if (!$payroll_reference) {
                return redirect()->back()->with('error', 'Payroll not found.');
            }

            // Check if already archived
            if ($payroll_reference['is_archive'] == 1) {
                return redirect()->back()->with('message', 'Payroll is already archived.');
            }



            // Update the is_archive flag to 1
            $payrollModel->where('reference_number', $reference_number)
                ->set(['is_archive' => 1])
                ->update();
---
SELECT *
FROM `tbl_payroll`
WHERE `reference_number` = '2025-902443'
 LIMIT 1
UPDATE `tbl_payroll` SET `is_archive` = 1
WHERE `reference_number` = '2025-902443'