app/Controllers/SettingsController.php

    public function index()
    {


        $session = session();

        if (!$session->get('logged_in')) {
            // If not logged in, redirect to the login page
            return redirect()->to('/login');
        }

        $model = new UserModel();
        $userId = $session->get('id');
        $data['user'] = $model->find($userId);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id` = '1'